Revit 2024 API
AlignmentStationLabelOptions Class
 Represents an object containing options for creating an AlignmentStationLabel.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public class AlignmentStationLabelOptions
Visual Basic
Public Class AlignmentStationLabelOptions
Visual C++
public ref class AlignmentStationLabelOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Infrastructure.AlignmentStationLabelOptions
See Also
AlignmentStationLabelOptions Members
Autodesk.Revit.DB.Infrastructure Namespace